balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1947.PIC
        <edc:SFRDef edc:access="nnn-nnn-" edc:cname="LCDREF" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000-" edc:name="LCDREF" edc:nzwidth="8" edc:por="000-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VLCD1PE" edc:desc="VLCD1 pin enable bit" edc:mask="0x1" edc:name="VLCD1PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD2PE" edc:desc="VLCD2 pin enable bit" edc:mask="0x1" edc:name="VLCD2PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD3PE" edc:desc="VLCD3 pin enable bit" edc:mask="0x1" edc:name="VLCD3PE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRI" edc:desc="LCD Internal Reference Ladder Idle Enable bit" edc:mask="0x1" edc:name="LCDIRI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRS" edc:desc="LCD Internal Reference Source bit" edc:mask="0x1" edc:name="LCDIRS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRE" edc:desc="LCD Internal Reference Enable bit" edc:mask="0x1" edc:name="LCDIRE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="LCDCST" edc:desc="LCD Contrast Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="LCDCST" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDCST0" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST1" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST2" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LCDCST" edc:desc="LCD Contrast Control bits" edc:mask="0x7" edc:name="LCDCST" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="LCDRL" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="LCDRL" edc:nzwidth="8" edc:por="0000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRLAT0" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT1" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT2" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP0" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP1" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP0" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP1" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LRLAT" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x7" edc:name="LRLAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x3" edc:name="LRLBP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LRLAP" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x3" edc:name="LRLAP" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE16" edc:desc="" edc:mask="0x1" edc:name="SE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE17" edc:desc="" edc:mask="0x1" edc:name="SE17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE18" edc:desc="" edc:mask="0x1" edc:name="SE18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE19" edc:desc="" edc:mask="0x1" edc:name="SE19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE20" edc:desc="" edc:mask="0x1" edc:name="SE20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE21" edc:desc="" edc:mask="0x1" edc:name="SE21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE22" edc:desc="" edc:mask="0x1" edc:name="SE22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE23" edc:desc="" edc:mask="0x1" edc:name="SE23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
