balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1947.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA15" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA15" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM1" edc:desc="" edc:mask="0x1" edc:name="SEG24COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM1" edc:desc="" edc:mask="0x1" edc:name="SEG25COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM1" edc:desc="" edc:mask="0x1" edc:name="SEG26COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM1" edc:desc="" edc:mask="0x1" edc:name="SEG27COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM1" edc:desc="" edc:mask="0x1" edc:name="SEG28COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM1" edc:desc="" edc:mask="0x1" edc:name="SEG29COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM1" edc:desc="" edc:mask="0x1" edc:name="SEG30COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM1" edc:desc="" edc:mask="0x1" edc:name="SEG31COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA16" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA16" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG32COM1" edc:desc="" edc:mask="0x1" edc:name="SEG32COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM1" edc:desc="" edc:mask="0x1" edc:name="SEG33COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM1" edc:desc="" edc:mask="0x1" edc:name="SEG34COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM1" edc:desc="" edc:mask="0x1" edc:name="SEG35COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM1" edc:desc="" edc:mask="0x1" edc:name="SEG36COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM1" edc:desc="" edc:mask="0x1" edc:name="SEG37COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM1" edc:desc="" edc:mask="0x1" edc:name="SEG38COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM1" edc:desc="" edc:mask="0x1" edc:name="SEG39COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="LCDDATA17" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="LCDDATA17" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG40COM1" edc:desc="" edc:mask="0x1" edc:name="SEG40COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM1" edc:desc="" edc:mask="0x1" edc:name="SEG41COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM1" edc:desc="" edc:mask="0x1" edc:name="SEG42COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM1" edc:desc="" edc:mask="0x1" edc:name="SEG43COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM1" edc:desc="" edc:mask="0x1" edc:name="SEG44COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM1" edc:desc="" edc:mask="0x1" edc:name="SEG45COM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA18" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM2" edc:desc="" edc:mask="0x1" edc:name="SEG24COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM2" edc:desc="" edc:mask="0x1" edc:name="SEG25COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM2" edc:desc="" edc:mask="0x1" edc:name="SEG26COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM2" edc:desc="" edc:mask="0x1" edc:name="SEG27COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM2" edc:desc="" edc:mask="0x1" edc:name="SEG28COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM2" edc:desc="" edc:mask="0x1" edc:name="SEG29COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM2" edc:desc="" edc:mask="0x1" edc:name="SEG30COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM2" edc:desc="" edc:mask="0x1" edc:name="SEG31COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA19" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA19" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG32COM2" edc:desc="" edc:mask="0x1" edc:name="SEG32COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM2" edc:desc="" edc:mask="0x1" edc:name="SEG33COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM2" edc:desc="" edc:mask="0x1" edc:name="SEG34COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM2" edc:desc="" edc:mask="0x1" edc:name="SEG35COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM2" edc:desc="" edc:mask="0x1" edc:name="SEG36COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM2" edc:desc="" edc:mask="0x1" edc:name="SEG37COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM2" edc:desc="" edc:mask="0x1" edc:name="SEG38COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM2" edc:desc="" edc:mask="0x1" edc:name="SEG39COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="LCDDATA20" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="LCDDATA20" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG40COM2" edc:desc="" edc:mask="0x1" edc:name="SEG40COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM2" edc:desc="" edc:mask="0x1" edc:name="SEG41COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM2" edc:desc="" edc:mask="0x1" edc:name="SEG42COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM2" edc:desc="" edc:mask="0x1" edc:name="SEG43COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM2" edc:desc="" edc:mask="0x1" edc:name="SEG44COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM2" edc:desc="" edc:mask="0x1" edc:name="SEG45COM2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
