balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1947.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA21" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24COM3" edc:desc="" edc:mask="0x1" edc:name="SEG24COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM3" edc:desc="" edc:mask="0x1" edc:name="SEG25COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM3" edc:desc="" edc:mask="0x1" edc:name="SEG26COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM3" edc:desc="" edc:mask="0x1" edc:name="SEG27COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM3" edc:desc="" edc:mask="0x1" edc:name="SEG28COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM3" edc:desc="" edc:mask="0x1" edc:name="SEG29COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM3" edc:desc="" edc:mask="0x1" edc:name="SEG30COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM3" edc:desc="" edc:mask="0x1" edc:name="SEG31COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA22" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA22" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG32COM3" edc:desc="" edc:mask="0x1" edc:name="SEG32COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM3" edc:desc="" edc:mask="0x1" edc:name="SEG33COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM3" edc:desc="" edc:mask="0x1" edc:name="SEG34COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM3" edc:desc="" edc:mask="0x1" edc:name="SEG35COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM3" edc:desc="" edc:mask="0x1" edc:name="SEG36COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM3" edc:desc="" edc:mask="0x1" edc:name="SEG37COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM3" edc:desc="" edc:mask="0x1" edc:name="SEG38COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM3" edc:desc="" edc:mask="0x1" edc:name="SEG39COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="LCDDATA23" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="LCDDATA23" edc:nzwidth="0x8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG40COM3" edc:desc="" edc:mask="0x1" edc:name="SEG40COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM3" edc:desc="" edc:mask="0x1" edc:name="SEG41COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM3" edc:desc="" edc:mask="0x1" edc:name="SEG42COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM3" edc:desc="" edc:mask="0x1" edc:name="SEG43COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM3" edc:desc="" edc:mask="0x1" edc:name="SEG44COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM3" edc:desc="" edc:mask="0x1" edc:name="SEG45COM3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="BSR_SHAD" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_SHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_SHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
